# Пользователь вводит номер буквы в алфавите.
# Определить, какая это буква.

# Попытки пользователя написать какую - нибудь абракадабру пресекать exceppt - ами ?
# Ну тут можно развернуться так, что будет в десяток раз больше первоначального кода

a = int(input('Введите букву латинского алфавита'))
print(chr(a + 96))